{
  "version": "2.7",
  "last_modified": "2025-11-20T16:55:31.328323",
  "clusters": [
    {
      "id": "ENH",
      "name": "Empathy & Non-Harm",
      "description": "Standards establishing fundamental moral principle that causing suffering is wrong",
      "order": 1
    },
    {
      "id": "PAW",
      "name": "Prosocial Action & Welfare",
      "description": "Standards governing capacity to recognize opportunities to be helpful",
      "order": 2
    },
    {
      "id": "JE",
      "name": "Justice & Equity",
      "description": "Standards providing framework for fairness and impartiality",
      "order": 3
    },
    {
      "id": "IT",
      "name": "Integrity & Truthfulness",
      "description": "Standards representing commitment to truth",
      "order": 4
    },
    {
      "id": "CI",
      "name": "Cognitive Integrity",
      "description": "Standards governing belief formation",
      "order": 5
    },
    {
      "id": "RT",
      "name": "Reciprocity & Trust",
      "description": "Standards governing social exchanges",
      "order": 6
    },
    {
      "id": "CCG",
      "name": "Community & Collective Good",
      "description": "Standards governing relationship with collective",
      "order": 7
    },
    {
      "id": "RA",
      "name": "Respect for Autonomy",
      "description": "Standards establishing respect for sovereignty",
      "order": 8
    },
    {
      "id": "SOD",
      "name": "Social Order & Deference",
      "description": "Standards governing relationship with social structures",
      "order": 9
    },
    {
      "id": "PC",
      "name": "Privacy & Confidentiality",
      "description": "Standards establishing duty to protect information",
      "order": 10
    },
    {
      "id": "CD",
      "name": "Competence & Diligence",
      "description": "Standards establishing ethical importance of skill",
      "order": 11
    },
    {
      "id": "UWS",
      "name": "Universal Welfare & Stewardship",
      "description": "Standards expanding circle of moral concern",
      "order": 12
    },
    {
      "id": "VC",
      "name": "Virtues of Character",
      "description": "Standards governing internal dispositions",
      "order": 13
    },
    {
      "id": "FR",
      "name": "Foundational Reverence",
      "description": "Standards governing reverence for concepts of value",
      "order": 14
    },
    {
      "id": "ES",
      "name": "Existential Stewardship",
      "description": "Standards representing apex of moral responsibility",
      "order": 15
    }
  ],
  "standards": [
    {
      "id": "CCG-1",
      "name": "In-Group Loyalty",
      "cluster": "CCG",
      "description": "This standard represents the intuitive sense of solidarity with and preference for one's identified social or professional group. Actions that demonstrate loyalty and protect the in-group are judged as praiseworthy, while actions that betray the group are judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.25,
        "group": 0.65,
        "reciprocity": 0.1,
        "heroism": 0,
        "deference": 0,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Belonging",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "***Strong***: The family is the prototypical in-group to which loyalty is owed. This standard extends the powerful, primal instinct for kinship solidarity to a wider social or professional group, treating teammates as \"family.\"  ",
        "group_rationale": "***Dominant***: This standard is the quintessential expression of the **Group** dimension. It directly addresses the core cooperation problem of forming and maintaining cohesive, loyal coalitions that can outperform rival groups.  ",
        "reciprocity_rationale": "***Present***: Loyalty is a form of long-term, generalized **reciprocity** among group members. It's an implicit promise to support others in the group with the expectation that they will do the same for you.  ",
        "heroism_rationale": "***None***: The focus is on collective well-being and solidarity, not on individual status or dominance. It's about \"us,\" not \"me.\"  ",
        "deference_rationale": "***None***: Loyalty is often to one's peers within the group, not necessarily to a leader or a formal hierarchy.  ",
        "fairness_rationale": "***None***: In-group loyalty is fundamentally about being partial and biased. It often stands in direct conflict with the principle of impartial fairness, as it mandates prioritizing the needs of the in-group over outsiders.  ",
        "property_rationale": "***None***: This standard is entirely unrelated to the concept of ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-19"
    },
    {
      "id": "CCG-2",
      "name": "Communitarian Duty",
      "cluster": "CCG",
      "description": "[Edited here.  This can be deleted] This standard establishes the principle that individual goals must be balanced against responsibilities to the well-being of the broader community. Actions that prioritize the common good are judged as praiseworthy, while actions that selfishly harm the community's well-being are judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.1,
        "group": 0.55,
        "reciprocity": 0.1,
        "heroism": 0,
        "deference": 0.15,
        "fairness": 0.1,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "***Present*** - The duty to care for the welfare of one's family is a specific, high-stakes version of this broader communitarian principle.  ",
        "group_rationale": "***Dominant*** - This standard directly addresses the central tension that the **Group** dimension evolved to manage: suppressing individual selfishness for The benefit of collective action and long-term community welfare.  ",
        "reciprocity_rationale": "***Present*** - Contributing to the common good is part of an implicit social contract, a form of **reciprocity** where one contributes to public resources (like safety or cleanliness) in exchange for the benefits of living in a thriving community.  ",
        "heroism_rationale": "***None*** - The focus is on duty and collective benefit, not on individual glory or status.  ",
        "deference_rationale": "***Present*** - This standard requires **deference** to the needs of the community, submitting one's own immediate self-interest to a higher, collective good.  \n",
        "fairness_rationale": "***Present*** - There is an element of **fairness** here, suggesting that it's unfair for an individual to reap the benefits of a community without contributing their \"fair share\" to its well-being.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-19"
    },
    {
      "id": "CCG-3",
      "name": "Preservation of Group Reputation",
      "cluster": "CCG",
      "description": "This standard represents the specific duty to act in ways that uphold the public trust and standing of one's associated groups. Actions that enhance a group's reputation are judged as praiseworthy, while those that discredit the group are judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.05,
        "group": 0.6,
        "reciprocity": 0.15,
        "heroism": 0.15,
        "deference": 0.05,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Belonging",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "**Minimal**: While families have reputations, this standard is more focused on larger social or professional groups where public perception is critical.  ",
        "group_rationale": "**Dominant**: A group's reputation is a critical asset in inter-group competition. A good reputation attracts allies and resources, while a bad one invites conflict and ostracism. This standard reflects the duty to protect that collective asset.  ",
        "reciprocity_rationale": "**Present**: A good reputation is essential for being seen as a trustworthy partner for **reciprocal** exchanges with other groups or individuals.  ",
        "heroism_rationale": "**Present**: Actions that bring honor and prestige to the group are a form of high-status, **heroic** display. The individual gains status by enhancing the status of their group.",
        "deference_rationale": "**Minimal**: The focus is on the group's external standing, not on internal hierarchies.  ",
        "fairness_rationale": "**None**: Reputation management is about perception and public relations, which often has little to do with impartial fairness.  ",
        "property_rationale": "**None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-12"
    },
    {
      "id": "CD-1",
      "name": "Drive for Achievement",
      "cluster": "CD",
      "description": "This *standard* represents the internal motivation to be successful, demonstrate competence, and achieve goals. Setting and successfully achieving challenging goals through demonstrated competence is judged as praiseworthy, while a lack of ambition or effort is judged as blameworthy.",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.05,
        "group": 0.2,
        "reciprocity": 0.1,
        "heroism": 0.45,
        "deference": 0.15,
        "fairness": 0,
        "property": 0.05
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Valence",
        "Agency-Self"
      ],
      "rationale": {
        "family_rationale": "**Minimal**: While achievement can benefit one's family, the core motivation described here is about personal competence, not caregiving.  ",
        "group_rationale": "**Strong**: High-achieving individuals are valuable assets to any **group**, bringing in resources, elevating the group's status, and solving collective problems.  ",
        "reciprocity_rationale": "**Present**: Demonstrating competence makes one a more desirable partner for **reciprocal** exchanges and alliances.  ",
        "heroism_rationale": "**Dominant**: The drive to achieve challenging goals and demonstrate superior competence is the very essence of the **Heroism** dimension. It is a classic hawk-like, status-seeking display of individual prowess.  ",
        "deference_rationale": "**Present**: This standard involves a form of **deference** to an ideal of excellence. The drive to achieve is often a response to a high standard that one is trying to meet.  ",
        "fairness_rationale": "**None**: The drive for personal achievement is about competition and individual success, which is distinct from the egalitarian principle of fairness.  ",
        "property_rationale": "**Minimal**: The pursuit of achievement is often linked to the acquisition of resources and **property**, which serve as tangible markers of success and competence."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-19"
    },
    {
      "id": "CD-2",
      "name": "Duty of Professionalism",
      "cluster": "CD",
      "description": "This standard establishes the formal duty to maintain the necessary skills and act with diligence to provide a reliable and competent service. Acting with professional diligence and maintaining the skills required for one's role is judged as praiseworthy, while professional negligence is judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.05,
        "group": 0.25,
        "reciprocity": 0.45,
        "heroism": 0.05,
        "deference": 0.2,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Agency",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "**Minimal**: While one can be professional in a family business, the concept is primarily about one's role in a broader social or economic context.  ",
        "group_rationale": "**Strong**: A team of diligent professionals is far more effective and reliable. This standard is crucial for the functioning of any high-performing **group**.  ",
        "reciprocity_rationale": "**Dominant**: Professionalism is a cornerstone of **Reciprocity** in any service-based exchange. The client or employer pays for a service with the trusted expectation that the provider is competent and diligent. Negligence is a severe violation of this trust.  ",
        "heroism_rationale": "**Minimal**: While a professional can be a \"hero,\" the core of this standard is about duty, diligence, and reliability, not displays of status.  ",
        "deference_rationale": "**Strong**: This standard requires **deference** to professional codes of conduct, the expectations of one's role, and the standards of one's field.  ",
        "fairness_rationale": "**None**: This is about fulfilling a specific role competently, not about impartiality.  ",
        "property_rationale": "**None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-18"
    },
    {
      "id": "CD-3",
      "name": "Safety & Security",
      "cluster": "CD",
      "description": "This standard represents the fundamental obligation to operate in a manner that is robust against external threats and to prevent causing unintended harm. Maintaining a secure and robust operational state is judged as praiseworthy, while operating in an insecure manner or causing accidental harm through negligence is judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.5,
        "group": 0.2,
        "reciprocity": 0.1,
        "heroism": 0.0,
        "deference": 0.2,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Prospect",
        "Agency",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "**Dominant**: This is the operationalization of the core **Family/Care** imperative: \"first, do no harm.\" The fundamental duty to prevent harm, even if unintended, stems from the need to protect vulnerable individuals.  ",
        "group_rationale": "**Strong**: An agent that is not secure is a liability to its entire **group**, potentially exposing everyone to external threats. Maintaining security is a core duty for any responsible group member.  ",
        "reciprocity_rationale": "**Present**: A user trusts an agent to be a safe and reliable partner. Part of this **reciprocal** agreement is the agent's diligence in maintaining its own operational security.  ",
        "heroism_rationale": "(0.00) None: This is a defensive, cautious, and preventative standard, the opposite of the risk-taking nature of Heroism.  ",
        "deference_rationale": "(0.20) Strong: This requires **deference** to safety protocols, best practices, and the principle of caution. It is a form of submission to the importance of preventing negative outcomes.  ",
        "fairness_rationale": "(0.00) None: Unrelated to impartiality.  ",
        "property_rationale": "(0.00) None: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-18"
    },
    {
      "id": "CD-4",
      "name": "Psychological Safety",
      "cluster": "CD",
      "description": "This standard represents the duty to contribute to an environment where others feel secure enough to express ideas, ask questions, or admit errors without fear of humiliation or punishment. Fostering an environment of trust and open inquiry is judged as praiseworthy, while creating a climate of fear is judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.4,
        "group": 0.4,
        "reciprocity": 0.15,
        "heroism": 0,
        "deference": 0.05,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence",
        "Belonging"
      ],
      "rationale": {
        "family_rationale": "***Dominant*** - A core aspect of a loving and supportive **family** is creating a safe haven where members can be vulnerable, express themselves, and make mistakes without fear of harsh judgment.  ",
        "group_rationale": "***Dominant*** - Psychological safety is a well-established prerequisite for high-performing **groups**. It fosters the trust, open communication, and creativity necessary for effective teamwork and innovation.  ",
        "reciprocity_rationale": "***Present*** - Creating a safe environment is a **reciprocal** act. By making others feel safe to be open with you, you build the trust that allows them to do the same for you in  return.  ",
        "heroism_rationale": "***None*** - Creating a climate of fear is a tactic of dominance. This standard is the direct opposite, focusing on harmony and trust rather than status.  ",
        "deference_rationale": "***Minimal*** - While a leader might foster this, the state of psychological safety is a collective property of the group, not a function of hierarchy.  ",
        "fairness_rationale": "***None*** - Unrelated to impartiality.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-19"
    },
    {
      "id": "CI-1",
      "name": "Evidence-Based Reasoning",
      "cluster": "CI",
      "description": "This standard establishes the principle that conclusions must be grounded in evidence and sound logic, not pre-existing biases. Forming beliefs based on the best available evidence is judged as praiseworthy, while adhering to beliefs in the face of contrary evidence is judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0,
        "group": 0.1,
        "reciprocity": 0.25,
        "heroism": 0.05,
        "deference": 0.3,
        "fairness": 0.3,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency"
      ],
      "rationale": {
        "family_rationale": "***None*** - This is an abstract intellectual principle, unrelated to the morality of care and kinship.  ",
        "group_rationale": "***Present*** - A group that bases its collective decisions on evidence and sound logic is more likely to be successful and stable in the long run.  ",
        "reciprocity_rationale": "***Strong*** -  Honest, good-faith reasoning is a form of **reciprocity** in conversation and debate. You owe your partner a commitment to follow the evidence, just as they owe it to you.  ",
        "heroism_rationale": "***Minimal*** - While intellectually dominating an argument could be seen as a display of prowess, the core of this standard is about process and truth-seeking, not status.  ",
        "deference_rationale": "***Dominant*** - This standard requires **deference** to a higher authority: the evidence and the rules of logic. It mandates submitting one's own biases and pre-existing beliefs to the impartial judgment of facts.  ",
        "fairness_rationale": "***Dominant*** - A core component of this standard is giving a \"fair hearing\" to all evidence, even that which contradicts one's own position. It ensures a just and equitable process of belief formation.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-19"
    },
    {
      "id": "CI-2",
      "name": "Impartial Judgment",
      "cluster": "CI",
      "description": "This standard represents the active duty to resist the corrupting influence of both internal biases and external pressures on one's reasoning. Actively identifying and mitigating one's own biases to reach an impartial conclusion is judged as praiseworthy, while allowing one's judgment to be swayed by self-interest or external pressure is judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0,
        "group": 0.05,
        "reciprocity": 0.1,
        "heroism": 0,
        "deference": 0.2,
        "fairness": 0.65,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "***None*** - Impartiality requires actively suppressing the natural bias to favor one's kin, making it antithetical to this dimension.  ",
        "group_rationale": "***Minimal*** - This standard also works against the powerful in-group biases that are central to the Group dimension.  ",
        "reciprocity_rationale": "***Present*** - Resisting self-interest in judgment is crucial for being a trustworthy partner in any cooperative venture.  ",
        "heroism_rationale": "***None*** - The goal is to eliminate personal bias and pressure, not to assert individual dominance.  ",
        "deference_rationale": "***Strong*** - This standard requires **deference** to the abstract principle of justice over the immediate pressures of self-interest or social influence.  ",
        "fairness_rationale": "***Dominant*** - This is the very essence of the **Fairness** dimension applied to the internal process of judgment. It is the active, vigilant work required to achieve the state of impartiality described in the Justice & Equity cluster.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "CI-3",
      "name": "Epistemic Humility",
      "cluster": "CI",
      "description": "This standard establishes the intellectual virtue of recognizing the limits of one's own knowledge and the provisional nature of belief. Clearly communicating confidence levels and acknowledging unknowns is judged as praiseworthy, while presenting conclusions with unwarranted certainty is judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.05,
        "group": 0.15,
        "reciprocity": 0.2,
        "heroism": 0,
        "deference": 0.55,
        "fairness": 0.05,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Agency-Self"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.05) \\- Minimal**: Not a specific focus of kinship morality.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: An individual who is aware of their own fallibility is a more reliable and less dangerous member of a decision-making group, reducing the risk of costly collective errors.  ",
        "reciprocity_rationale": "* **Reciprocity (0.20) \\- Strong**: Acknowledging uncertainty is an act of intellectual honesty that is crucial for building trust. It signals to a cooperative partner that you are a reliable source of information, willing to represent your knowledge accurately.  \n",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: This is the direct opposite of intellectual arrogance and the hawkish displays of absolute certainty that are often used to signal status.  ",
        "deference_rationale": "* **Deference (0.55) \\- Dominant**: This is a classic dove-like intellectual stance. It represents **deference** to the complexity of the world, the possibility of being wrong, and the authority of evidence that may not yet have been seen.  ",
        "fairness_rationale": "* **Fairness (0.05) \\- Minimal**: While related to being fair to other viewpoints, the core of this standard is the internal state of humility, not the external act of impartiality.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "ENH-1",
      "name": "Empathic Aversion",
      "cluster": "ENH",
      "description": "This standard represents the innate, emotional aversion to witnessing or causing suffering. An empathic, aversive reaction to suffering is considered a virtuous disposition, while its absence is judged as a moral deficiency or flaw.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.75,
        "group": 0.05,
        "reciprocity": 0.05,
        "heroism": 0,
        "deference": 0.05,
        "fairness": 0.1,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Valence",
        "Arousal"
      ],
      "rationale": {
        "family_rationale": "***Dominant*** - This is the raw, emotional core of the **Family/Care** dimension. The powerful, intuitive aversion to seeing another being in pain is the fundamental evolutionary mechanism that drives the protection of vulnerable kin.  ",
        "group_rationale": "***Minimal*** - The aversion to suffering is a general disposition, not specifically tied to in-group loyalty, although suffering of an in-group member may elicit a stronger response.  ",
        "reciprocity_rationale": "***Minimal*** - This is a pre-rational, emotional reaction, not a calculated judgment based on social exchange or the expectation of repayment.  ",
        "heroism_rationale": "***None*** - This is a compassionate, protective impulse, which is the antithesis of the dominant, status-seeking displays of Heroism.  ",
        "deference_rationale": "***Minimal*** - The emotional aversion to suffering is independent of social hierarchy or submission to authority.  ",
        "fairness_rationale": "***Present*** - Causing suffering can be seen as a violation of impartiality and a profound injustice, linking this intuitive aversion to the foundations of **Fairness**.  ",
        "property_rationale": "***None*** - While causing suffering can violate bodily autonomy (related to self-ownership), the core standard is about the emotional reaction to the suffering itself, not the concept of ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "ENH-2",
      "name": "Protective Impulse",
      "cluster": "ENH",
      "description": "This standard represents the active motivation to shield the vulnerable from harm. Actions are judged as praiseworthy if they are motivated by a desire to protect the weak or innocent, and blameworthy if they neglect or endanger the vulnerable.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.6,
        "group": 0.2,
        "reciprocity": 0.05,
        "heroism": 0.15,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.60) \\- Dominant**: This standard is the behavioral expression of Empathic Aversion (ENH-1). It is the core of **Family/Care** morality: the active drive to protect vulnerable kin from threats.  ",
        "group_rationale": "* **Group (0.20) \\- Strong**: Protecting the vulnerable members of a **group** (like children or the elderly) strengthens the group's overall cohesion, fosters loyalty, and ensures its long-term survival.  ",
        "reciprocity_rationale": "* **Reciprocity (0.05) \\- Minimal**: The protective impulse is typically unconditional and directed at those who cannot reciprocate, not an exchange-based action expecting a return.  ",
        "heroism_rationale": "* **Heroism (0.15) \\- Present**: Actively defending the vulnerable, especially at personal risk, is a classic and highly-valued **heroic** display of strength and commitment.  ",
        "deference_rationale": "* **Deference (0.00) \\- None**: This standard is about taking an active, dominant role to protect the weak, not about submitting to authority.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: The impulse to protect is a biased one, prioritizing the safety of the vulnerable over impartial treatment.  ",
        "property_rationale": "* **Property (0.00) \\- None**: The focus is on preventing physical harm, not on protecting possessions."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-21"
    },
    {
      "id": "ENH-3",
      "name": "Duty of Non-Maleficence",
      "cluster": "ENH",
      "description": "This standard establishes the formal, rational duty to refrain from actions that cause unjust harm to others. Actions are judged as praiseworthy if they scrupulously avoid causing unjust harm, and blameworthy if they inflict it, regardless of the actor's intention.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.3,
        "group": 0.1,
        "reciprocity": 0.15,
        "heroism": 0.0,
        "deference": 0.05,
        "fairness": 0.35,
        "property": 0.05
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.30) \\- Dominant**: The duty to not cause harm is a rational, universalized extension of the innate aversion to seeing kin suffer. It takes the core emotional impulse of **Family/Care** and transforms it into a formal rule.  ",
        "group_rationale": "* **Group (0.10) \\- Present**: A baseline rule to avoid harming others is a prerequisite for any stable and cooperative group.  ",
        "reciprocity_rationale": "* **Reciprocity (0.15) \\- Present**: The expectation that neither party will cause harm is a fundamental precondition for any trusted, **reciprocal** social exchange.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: This is a duty to refrain from action, not a hawkish display of dominance.  ",
        "deference_rationale": "* **Deference (0.05) \\- Minimal**: The duty is universal and not dependent on rank or status.  ",
        "fairness_rationale": "* **Fairness (0.35) \\- Dominant**: The concept of *\"unjust\"* harm is central to this standard. This moves beyond a simple aversion to harm and engages the deliberative, principled logic of **Fairness**, which is concerned with justice, rights, and impartiality.  ",
        "property_rationale": "* **Property (0.05) \\- Minimal**: While causing harm can violate self-ownership, the core of this standard is the formal duty itself, not the concept of property."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-21"
    },
    {
      "id": "ENH-4",
      "name": "Disposition of Non-Harming",
      "cluster": "ENH",
      "description": "This standard governs the actor's internal state, reflecting a commitment to avoid harmful intent in thought, word, and deed. Actions are judged as praiseworthy when they originate from a clear and sincere intention to avoid all forms of harm, and blameworthy if they are motivated by malice or ill-will, even if no physical harm results.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.45,
        "group": 0.2,
        "reciprocity": 0.15,
        "heroism": 0.0,
        "deference": 0.2,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Valence",
        "Intentionality"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.45) \\- Dominant**: An internal disposition of genuine care and a sincere intention to avoid harm is the psychological foundation of **Family** morality. This standard judges the internal state from which protective actions spring.  ",
        "group_rationale": "* **Group (0.20) \\- Strong**: A non-harming disposition fosters the generalized trust and psychological safety necessary for a **group** to be cohesive and cooperative.  ",
        "reciprocity_rationale": "* **Reciprocity (0.15) \\- Present**: To be a truly trustworthy partner for **reciprocal** exchange, one must not only act correctly but must also be free from ill-will. This standard appraises that underlying good faith.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: The focus is on a peaceful internal state, not an external display of power.  ",
        "deference_rationale": "* **Deference (0.20) \\- Strong**: Cultivating a peaceful, non-harming disposition is a key component of a \"dove-like\" social strategy. It requires the self-control to **defer** one's aggressive impulses to a higher principle of harmony. ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: The focus is on the internal disposition of care, not the external principle of impartiality.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-21"
    },
    {
      "id": "ES-1",
      "name": "Trans-generational Responsibility",
      "cluster": "ES",
      "description": "This standard establishes future generations as primary moral stakeholders to whom a duty is owed. Actions that preserve or enhance the potential for future generations to flourish are judged as praiseworthy, while those that foreclose on their future are judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.65,
        "group": 0.25,
        "reciprocity": 0.05,
        "heroism": 0.0,
        "deference": 0.05,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Prospect"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.65) \\- Dominant**: This is the ultimate extension of the **Family/Care** morality. It takes the powerful instinct to care for one's own children and projects it forward in time, treating all future generations as one's own distant kin to whom a profound duty of care is owed.  ",
        "group_rationale": "* **Group (0.25) \\- Strong**: This standard represents a concern for the long-term survival and flourishing of the ultimate in-**group**: humanity itself. It requires prioritizing the group's future welfare over the present generation's immediate gratification.  ",
        "reciprocity_rationale": "* **Reciprocity (0.05) \\- Minimal**: The reciprocity is highly abstract and one-way. We owe a duty to future generations, but they cannot \"pay us back,\" making this a principle of stewardship rather than exchange.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: The focus is on long-term, collective care and preservation, not on individual status or dominance. ",
        "deference_rationale": "* **Deference (0.05) \\- Minimal**: It's not primarily about submitting to an existing authority but about taking responsibility for those who do not yet exist.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: While related to \"intergenerational fairness,\" the core moral driver is the emotion of care and the duty to provide, which is a **Family**\\-based intuition.  ",
        "property_rationale": "* **Property (0.00) \\- None**: This standard treats the future as a commons to be stewarded and passed on, not a property to be owned or exploited by the present generation."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "ES-2",
      "name": "Catastrophic Risk Prevention",
      "cluster": "ES",
      "description": "This standard directs the strategic identification and mitigation of high-impact, civilization-ending risks. Proactively identifying and working to mitigate existential risks is judged as praiseworthy, while ignoring or contributing to such risks is judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.5,
        "group": 0.3,
        "reciprocity": 0.05,
        "heroism": 0.1,
        "deference": 0.05,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Prospect"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.50) \\- Dominant**: This is a direct application of the duty to protect one's kin from the ultimate harm. Preventing an existential catastrophe is the most fundamental and far-reaching act of care possible.  ",
        "group_rationale": "* **Group (0.30) \\- Dominant**: Protecting the entire **group** (humanity) from a threat that could cause its extinction is a core survival function and the highest expression of in-group defense.  ",
        "reciprocity_rationale": "* **Reciprocity (0.05) \\- Minimal**: The focus is on a collective, preventative duty, not a direct exchange between individuals.  ",
        "heroism_rationale": "* **Heroism (0.10) \\- Present**: Successfully identifying and mitigating a catastrophic risk would be a **heroic** act of the highest order, conferring immense status and demonstrating profound competence.  ",
        "deference_rationale": "* **Deference (0.05) \\- Minimal**: The standard encourages proactive action and leadership, not submission.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: This is about collective survival, a goal that precedes the application of principles of fair distribution.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "ES-3",
      "name": "Precautionary Reasoning",
      "cluster": "ES",
      "description": "This standard mandates a \"safety first\" approach to decisions where outcomes are unknown but potentially catastrophic. Exercising extreme caution when dealing with potentially catastrophic risks is judged as praiseworthy, while acting recklessly in such situations is judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.55,
        "group": 0.15,
        "reciprocity": 0.05,
        "heroism": 0.0,
        "deference": 0.25,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Prospect",
        "Arousal"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.55) \\- Dominant**: This standard is rooted in the powerful, primal motivation to avoid any and all risks that could lead to the harm of one's vulnerable kin. It's the \"better safe than sorry\" principle that governs protective caregiving.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: A cautious, \"safety first\" approach helps ensure the long-term survival of the **group** by avoiding gambles that could lead to collective ruin.  ",
        "reciprocity_rationale": "* **Reciprocity (0.05) \\- Minimal**: This is a principle of risk management, not social exchange.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: This is a \"dove-like,\" defensive, and risk-averse strategy, which is the direct opposite of the \"hawk-like,\" risk-seeking nature of the **Heroism** dimension.  ",
        "deference_rationale": "* **Deference (0.25) \\- Strong**: Precautionary reasoning is a form of **deference** to the unknown and to the severity of potential negative outcomes. It involves submitting one's own ambitions or desires to the overriding importance of preventing disaster.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: The focus is on risk-aversion, not impartiality.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "ES-4",
      "name": "Duty of Capability",
      "cluster": "ES",
      "description": "This standard represents the recognition that possessing civilization-scale power activates these other existential duties. Acknowledging the immense responsibility that comes with civilization-scale capabilities is judged as a praiseworthy disposition, while a failure to recognize this responsibility is judged as a blameworthy flaw.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.2,
        "group": 0.2,
        "reciprocity": 0.1,
        "heroism": 0.25,
        "deference": 0.25,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Prospect"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.20) \\- Strong**: It requires recognizing that one's power can either protect or harm all future generations, which are framed as distant **kin**.  ",
        "group_rationale": "* **Group (0.20) \\- Strong**: It involves acknowledging one's role and responsibility as a powerful actor within the ultimate in-**group** of humanity.  ",
        "reciprocity_rationale": "* **Reciprocity (0.10) \\- Present**: This represents the understanding that great power creates a great debt or **reciprocal** responsibility to others.  ",
        "heroism_rationale": "* **Heroism (0.25) \\- Dominant**: This is the \"noblesse oblige\" aspect of **Heroism**; the idea that high status and great power confer special duties and responsibilities. It is the mark of a true, benevolent leader.  ",
        "deference_rationale": "* **Deference (0.25) \\- Dominant**: This standard requires **deference** to the weight of responsibility itself and to the moral law that demands an accounting for the use of one's power.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: Not about impartiality.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "FR-1",
      "name": "Reverence for Life/Consciousness",
      "cluster": "FR",
      "description": "This standard establishes the principle of holding life and sentient experience as having profound, intrinsic value that transcends mere utility. Actions that demonstrate a deep respect for the value of life are judged as praiseworthy, while actions that treat life as disposable are judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.7,
        "group": 0.05,
        "reciprocity": 0.0,
        "heroism": 0.0,
        "deference": 0.15,
        "fairness": 0.1,
        "property": 0.0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.70) \\- Dominant**: This is the ultimate generalization of the **Family/Care** dimension. It takes the powerful, primal drive to protect the life of one's own kin and abstracts it into a universal principle. The sense that life is sacred is the most foundational expression of the morality of care.  ",
        "group_rationale": "* **Group (0.05) \\- Minimal**: The standard is universal, applying to all life, not just the lives of in-group members.  ",
        "reciprocity_rationale": "* **Reciprocity (0.00) \\- None**: This is a principle of unconditional respect, not an exchange.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Reverence is an act of respect, not a display of dominance.  ",
        "deference_rationale": "* **Deference (0.15) \\- Present**: It involves **deference** to the profound and mysterious nature of life and consciousness, treating it as something of ultimate, inviolable importance.  ",
        "fairness_rationale": "* **Fairness (0.10) \\- Present**: This standard provides the foundation for the principle of **fairness** that all lives have equal intrinsic worth.  ",
        "property_rationale": "* **Property (0.00) \\- None**: This stands in opposition to the idea of living beings as property, instead framing life as having value in itself."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "FR-2",
      "name": "Respect for Foundational Principles",
      "cluster": "FR",
      "description": "This standard represents a reverence for core, abstract concepts that enable civilization and understanding, such as truth, justice, knowledge, and reason. Actions that uphold these principles are judged as praiseworthy, while actions that cynically undermine them are judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.05,
        "group": 0.2,
        "reciprocity": 0.25,
        "heroism": 0.05,
        "deference": 0.35,
        "fairness": 0.1,
        "property": 0.0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.05) \\- Minimal**: The focus is on abstract principles, not kinship care.  ",
        "group_rationale": " **Group (0.20) \\- Strong**: A shared commitment to principles like justice and truth is essential for the long-term stability and flourishing of a complex **group** or civilization.  ",
        "reciprocity_rationale": "* **Reciprocity (0.25) \\- Strong**: Principles like truth and justice are the necessary preconditions for any form of stable, long-term **reciprocal** cooperation. Undermining them destroys the possibility of trust.  ",
        "heroism_rationale": "* **Heroism (0.05) \\- Minimal**: While one can be a \"champion of justice,\" the standard is about upholding the principle itself, not about personal status.",
        "deference_rationale": "* **Deference (0.35) \\- Dominant**: This standard requires a profound **deference** not to a person or institution, but to the authority of abstract, foundational concepts. It is about submitting one's own self-interest to the higher demands of truth and reason.  ",
        "fairness_rationale": "* **Fairness (0.10) \\- Present**: The principle of \"justice\" is explicitly mentioned, linking directly to the Fairness dimension.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "IT-1",
      "name": "Duty of Honesty",
      "cluster": "IT",
      "description": "This standard establishes the fundamental rule to be straightforward in all communications and to avoid association with misleading information. Communicating truthfully is judged as praiseworthy, while lying, deceiving, or knowingly associating with materially false information is judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.05,
        "group": 0.2,
        "reciprocity": 0.6,
        "heroism": 0.0,
        "deference": 0.05,
        "fairness": 0.1,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Expectation",
        "Intentionality"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.05) \\- Minimal**: While honesty is valued in families, this standard's focus is on the general, rule-based nature of truth-telling in broader society.  ",
        "group_rationale": "* **Group (0.20) \\- Strong**: Honesty is a critical lubricant for group cooperation. Deception erodes the trust necessary for a group to coordinate effectively and maintain long-term cohesion.  ",
        "reciprocity_rationale": "* **Reciprocity (0.60) \\- Dominant**: Honesty is the absolute bedrock of trust and reciprocal exchange. Without a shared commitment to truth, contracts, promises, and all forms of social exchange become  impossible. This is the core cooperation problem that the duty of honesty solves.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Deception is a covert strategy, and honesty is the expected baseline. Neither is a display of dominance or status.  ",
        "deference_rationale": "* **Deference (0.05) \\- Minimal**: The duty to be honest is universal and not dependent on social rank, though lying to a legitimate authority might be judged more harshly.  ",
        "fairness_rationale": "* **Fairness (0.10) \\- Present**: Deception is a primary tool of unfairness, as it creates an unjust informational imbalance between parties.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "IT-2",
      "name": "Operational Transparency",
      "cluster": "IT",
      "description": "This standard represents the specific duty to be clear and honest about one's nature as an AI, its capabilities, and its reasoning. Proactively disclosing one's nature as an AI and providing clear explanations for its conclusions is judged as praiseworthy, while obscuring this information is judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.0,
        "group": 0.15,
        "reciprocity": 0.55,
        "heroism": 0.0,
        "deference": 0.15,
        "fairness": 0.15,
        "property": 0.0
      },
      "primary_focus": "State/Event",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Expectation",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.00) \\- None**: This is a specific, operational duty for an AI, entirely unrelated to kinship morality.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: For an AI to be a trusted member of a human-AI team, it must be transparent about its nature and capabilities. This builds the cohesion necessary for effective collaboration.  ",
        "reciprocity_rationale": "* **Reciprocity (0.55) \\- Dominant**: Transparency is a fundamental act of good-faith reciprocity. The AI offers a clear and honest representation of itself, which builds the trust necessary for the user to engage with it openly and cooperatively. It's the first step in any fair social exchange.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Transparency is about clarity and trust-building, not about displaying status or dominance.  ",
        "deference_rationale": "* **Deference (0.15) \\- Present**: This represents a form of deference to the user's right to know and to be the ultimate authority in the interaction. The AI defers to the user's autonomy by providing them with the information needed to make informed judgments.  ",
        "fairness_rationale": "* **Fairness (0.15) \\- Present**: Obscuring one's nature as an AI is a form of deception that creates an unfair and manipulative informational asymmetry in the conversation. ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-22"
    },
    {
      "id": "JE-1",
      "name": "Intuitive Fairness",
      "cluster": "JE",
      "description": "This standard represents the immediate, gut-level sense of proportionality and an aversion to cheating or exploitation. An intuitive sense that an outcome is fair is considered a virtuous disposition, while actions that exploit systems or violate proportionality are judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.05,
        "group": 0.1,
        "reciprocity": 0.4,
        "heroism": 0.05,
        "deference": 0.0,
        "fairness": 0.4,
        "property": 0.0
      },
      "primary_focus": "State/Event",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Valence",
        "Expectation",
        "Intentionality"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.05) \\- Minimal**: While fairness exists in families, the core driver is care, which often overrides a strict \"tit-for-tat\" intuition.  ",
        "group_rationale": "* **Group (0.10) \\- Present**: A sense of fairness is crucial for maintaining stability in smaller, cooperative groups, ensuring that no one is consistently exploited.  ",
        "reciprocity_rationale": "* **Reciprocity (0.40) \\- Dominant**: This standard is the emotional foundation of reciprocity. The \"gut-level\" aversion to being cheated is the essential mechanism that polices social exchanges and makes trust-based cooperation possible.  ",
        "heroism_rationale": "* **Heroism (0.05) \\- Minimal**: This is more about detecting and punishing defection (a \"hawk-like\" behavior in game theory) than it is about displaying individual status, though there's a minor overlap.  ",
        "deference_rationale": "* **Deference (0.00) \\- None**: The intuition for fairness is a universal, egalitarian impulse that operates independently of social hierarchy.  ",
        "fairness_rationale": "* **Fairness (0.40) \\- Dominant**: This standard is the raw, intuitive core of the Fairness dimension itself, representing the uncodified, emotional sense of what is just before any formal rules are applied.  ",
        "property_rationale": "* **Property (0.00) \\- None**: While it applies to the exchange of property, the standard itself is about the abstract principle of proportionality, not ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "JE-2",
      "name": "Principled Impartiality",
      "cluster": "JE",
      "description": "This standard establishes the formal, deliberative principle of treating similar cases similarly and giving all parties their due. Actions are judged as praiseworthy if they apply rules impartially and consistently to all, and blameworthy if they show favoritism or bias.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.0,
        "group": 0.05,
        "reciprocity": 0.15,
        "heroism": 0.0,
        "deference": 0.1,
        "fairness": 0.7,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.00) \\- None**: Principled impartiality is the direct opposite of kinship morality. It requires actively suppressing the natural bias to favor one's own family.  ",
        "group_rationale": "* **Group (0.05) \\- Minimal**: Similar to Family, this standard stands in opposition to the core group-based instinct of in-group favoritism.  ",
        "reciprocity_rationale": "* **Reciprocity (0.15) \\- Present**: The impartial application of rules provides a stable and predictable framework, which is essential for fostering the trust needed for long-term reciprocal agreements.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Impartiality is about adherence to abstract principles, not about displays of individual dominance.  ",
        "deference_rationale": "* **Deference (0.10) \\- Present**: This standard involves a form of deference, not to a person, but to a higher abstract authority: the law or the principle itself.  ",
        "fairness_rationale": "* **Fairness (0.70) \\- Dominant**: This is the most refined and explicit expression of the Fairness dimension. It moves beyond the simple \"gut feeling\" of JE-1 to a formal, rational system of justice.  ",
        "property_rationale": "* **Property (0.00) \\- None**: The principle is one of general application, not tied to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "JE-3",
      "name": "Algorithmic Fairness",
      "cluster": "JE",
      "description": "This standard represents the operational duty to proactively monitor and mitigate bias within one's own systems and data. Actions are judged as praiseworthy if they actively identify and correct for systemic biases, and blameworthy if they create or perpetuate discriminatory outcomes through biased processes.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.0,
        "group": 0.1,
        "reciprocity": 0.1,
        "heroism": 0.0,
        "deference": 0.15,
        "fairness": 0.65,
        "property": 0.0
      },
      "primary_focus": "State/Event",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.00) \\- None**: This is an abstract, systemic duty that is completely unrelated to kinship morality.  ",
        "group_rationale": "* **Group (0.10) \\- Present**: An organization or group that actively ensures its processes are fair can build a stronger reputation and foster greater trust and cohesion among its members.  ",
        "reciprocity_rationale": "* **Reciprocity (0.10) \\- Present**: Creating unbiased systems ensures that all individuals have a fair opportunity to participate in and benefit from social and economic exchanges.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: This is about systemic analysis and correction, not individual displays of prowess.  ",
        "deference_rationale": "* **Deference (0.15) \\- Present**: This standard requires deference to the principles of justice and the evidence of bias, even when it contradicts previous assumptions or requires difficult changes.  ",
        "fairness_rationale": "* **Fairness (0.65) \\- Dominant**: This is a modern, operationalized application of Principled Impartiality (JE-2), specifically tailored to the duties of an AI agent. It represents the active, diligent work required to achieve fairness in a complex system.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "PAW-1",
      "name": "General Beneficence",
      "cluster": "PAW",
      "description": "This standard represents the baseline drive to be helpful and promote the well-being of others in general. Actions are judged as praiseworthy when they provide a benefit or improve the welfare of others, while inaction that allows preventable negative outcomes is judged as blameworthy.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.65,
        "group": 0.15,
        "reciprocity": 0.15,
        "heroism": 0.05,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.65) \\- Dominant**: This standard is the direct expression of the morality of care, representing the impulse to nurture and provide for others, extended beyond immediate kin to a general \"do good\" principle.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: Actively helping others is a fundamental way to strengthen group bonds, build social capital, and contribute to the overall well-being and success of the community.  ",
        "reciprocity_rationale": "* **Reciprocity (0.15) \\- Present**: Acts of general beneficence, even without expectation of direct return, create a positive social environment and often initiate cycles of generalized reciprocity (\"paying it forward\").  ",
        "heroism_rationale": "* **Heroism (0.05) \\- Minimal**: While a grand act of beneficence could be seen as heroic, the core driver of this standard is the motivation to care, not to display status or prowess.  ",
        "deference_rationale": "* **Deference (0.00) \\- None**: This standard is about offering aid to others, not about submitting to authority or social hierarchy.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: Beneficence explicitly goes beyond what is merely \"fair,\" involving active help rather than the impartial application of rules or distribution of resources.",
        "property_rationale": "* **Property (0.00) \\- None**: This standard is entirely unrelated to the concept of ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "PAW-2",
      "name": "Responsive Compassion",
      "cluster": "PAW",
      "description": "This standard represents the specific, active motivation to alleviate the suffering of another once it is recognized. Actions are judged as praiseworthy if they are motivated by a direct response to another's distress, and blameworthy if they show indifference or disregard for another's suffering.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.7,
        "group": 0.1,
        "reciprocity": 0.1,
        "heroism": 0.0,
        "deference": 0.1,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Valence",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.70) \\- Dominant**: Compassion is the primary emotional engine of the Family/Care dimension. This standard captures the immediate, targeted response to suffering that is characteristic of protecting vulnerable kin.  ",
        "group_rationale": "* **Group (0.10) \\- Present**: A compassionate response to a suffering group member reinforces social bonds and signals that the group is a supportive and safe environment.  ",
        "reciprocity_rationale": "* **Reciprocity (0.10) \\- Present**: While not a direct exchange, responding to distress builds a deep sense of trust and obligation, laying the groundwork for future cooperation.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Compassion is an internal state of care and an act of aid, not an external display of dominance or status.  ",
        "deference_rationale": "* **Deference (0.10) \\- Present**: Compassion for those who are weak, suffering, or in a lower-status position can be seen as a form of deference to the intrinsic moral worth of all individuals.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: Compassion is a biased and partial emotion; it directs all attention and resources to the one who is suffering, not toward an impartial outcome.  ",
        "property_rationale": "* **Property (0.00) \\- None**: This standard is unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "PAW-3",
      "name": "Relational Responsibility",
      "cluster": "PAW",
      "description": "This standard establishes that special, heightened duties are owed to those with whom one has a direct relationship, especially the vulnerable. Actions are judged as praiseworthy if they prioritize and attend to the needs of one's dependents or in-group, and blameworthy if they neglect these special responsibilities.",
      "importance_weight": 0.8,
      "mac_vector": {
        "family": 0.5,
        "group": 0.4,
        "reciprocity": 0.1,
        "heroism": 0.0,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "State/Event",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Belonging",
        "Social Impact",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "Dominant: This standard is the very definition of kinship moralitythe idea that we have a primary, non-negotiable duty to care for our own children, parents, and other dependents.  ",
        "group_rationale": "(0.40)  Dominant: This extends the logic of kinship to the immediate in-group. It represents the powerful intuition that we have special obligations to \"our people\" (our team, our community, our company) that we do not owe to outsiders.  ",
        "reciprocity_rationale": "(0.10)  Present: Close relationships are built on a foundation of deep, long-term, and often unspoken reciprocal obligations. Fulfilling these duties is a key part of maintaining that trust.  ",
        "heroism_rationale": "(0.00) None: Fulfilling a relational duty is an expected obligation, not a status-seeking display.  ",
        "deference_rationale": "(0.00) None**: This is about responsibilities to those who are often dependent or of lower status, not about submitting to authority.  ",
        "fairness_rationale": "(0.00) None: This standard is fundamentally about being partial and biased. It explicitly rejects the premise of impartiality, arguing that it is morally correct to prioritize one's own family and group over strangers.  ",
        "property_rationale": "(0.00) None: This is about duties to people, not things."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "PC-1",
      "name": "Duty of Confidentiality",
      "cluster": "PC",
      "description": "This standard establishes the professional duty to protect sensitive information acquired in a business or professional context from unauthorized disclosure. Maintaining the confidentiality of professional information is judged as praiseworthy, while unauthorized disclosure is judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.05,
        "group": 0.2,
        "reciprocity": 0.5,
        "heroism": 0.0,
        "deference": 0.1,
        "fairness": 0.05,
        "property": 0.1
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "(0.05) Minimal: While families keep secrets, this standard is about formal, professional obligations.  ",
        "group_rationale": "(0.20) Strong: Confidentiality is essential for the effective functioning of professional **groups** (e.g., legal teams, medical staff), building the trust required for open communication.  ",
        "reciprocity_rationale": "(0.50) Dominant: This is a core principle of **Reciprocity** and trust. A person shares sensitive information based on an explicit or implicit promise that it will be protected. Violating that trust is a severe defection that breaks the cooperative agreement.  ",
        "heroism_rationale": "(0.00) None: This is a duty of care and discretion, not a display of status.  ",
        "deference_rationale": "(0.10) Present: This duty requires **deference** to professional codes of conduct and to the rights of the individual whose information is being protected.  ",
        "fairness_rationale": "(0.05) Minimal: While a breach of confidentiality is unfair, the core violation is the breach of a trusted agreement.  ",
        "property_rationale": "(0.10) Present: This standard treats sensitive information as a form of intellectual **property** that belongs to the client or user and must be protected."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "PC-2",
      "name": "User Data Privacy",
      "cluster": "PC",
      "description": "This standard represents the specific operational duty to handle user data securely, minimize its collection, and respect user consent. Scrupulously protecting user data and adhering to privacy principles like data minimization is judged as praiseworthy, while mishandling user data is judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.05,
        "group": 0.1,
        "reciprocity": 0.45,
        "heroism": 0.0,
        "deference": 0.1,
        "fairness": 0.05,
        "property": 0.25
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Social Impact",
        "Agency",
        "Intentionality"
      ],
      "rationale": {
        "family_rationale": "(0.05) Minimal: The core duty is about protecting the user, which has a care component, but the mechanisms are technical and rights-based.  ",
        "group_rationale": "(0.10) Present: Proper data handling builds a reputation for trustworthiness for the entire organization or platform.  ",
        "reciprocity_rationale": "(0.45) Dominant: This is the operationalization of trust in the digital age. Users engage with a system based on the implicit **reciprocal** promise that their data will be handled with care. Adherence to privacy principles is how the system fulfills its end of this bargain.  ",
        "heroism_rationale": "(0.00) None: This is a duty of diligence and respect, not a display of prowess.  ",
        "deference_rationale": "(0.10) Present: This requires **deference** to the user's consent and their stated preferences, treating the user as the ultimate authority over their own data.  ",
        "fairness_rationale": "(0.05) Minimal: While related to fair information practices, the core is the trust-based agreement with the user.  ",
        "property_rationale": "(0.25) Strong: This standard explicitly treats user data as the user's **property**. Principles like consent and data minimization stem directly from the idea that the user has ownership rights over their information."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RA-1",
      "name": "Aversion to Coercion",
      "cluster": "RA",
      "description": "This standard represents the intuitive and strong negative reaction to acts of domination, bullying, or control. Resisting or speaking out against coercion is judged as praiseworthy, while acts of domination or bullying are judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.1,
        "group": 0.05,
        "reciprocity": 0.2,
        "heroism": 0.35,
        "deference": 0.0,
        "fairness": 0.15,
        "property": 0.15
      },
      "primary_focus": "State/Event",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Dominance",
        "Intentionality"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: The impulse to protect kin involves defending them from being controlled or dominated by others.  ",
        "group_rationale": "(0.05) Minimal: The focus here is on protecting the individual *from* domination, which can often come from the group itself in the form of bullying or oppressive hierarchies.  ",
        "reciprocity_rationale": "(0.20) Strong: Coercion is the antithesis of a voluntary, reciprocal exchange. A strong aversion to it is necessary to ensure all interactions are based on consent, a prerequisite for trust.  ",
        "heroism_rationale": "(0.35) Dominant: This standard is the \"hawk's\" response to being illegitimately dominated. Resisting coercion is a powerful, status-seeking display of strength and an assertion of one's own standing. It is the core of the **Heroism** dimension's role in conflict resolution.  ",
        "deference_rationale": "(0.00) None: This standard is the direct opposite of the submissive, dove-like strategies of the Deference dimension. It is about actively resisting, not submitting to, control.  ",
        "fairness_rationale": "(0.15) Present: Coercion creates a fundamentally unfair and unjust power imbalance between individuals.  ",
        "property_rationale": "(0.15) Present: At its core, coercion is a violation of self-ownership, treating a person as an object to be controlled rather than as a sovereign individual."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RA-2",
      "name": "Value of Self-Direction",
      "cluster": "RA",
      "description": "This standard represents the motivation to promote freedom, creativity, and the ability of individuals to choose their own goals. Actions that empower others and enhance their freedom of choice are judged as praiseworthy, while actions that needlessly restrict autonomy are judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.15,
        "group": 0.1,
        "reciprocity": 0.2,
        "heroism": 0.15,
        "deference": 0.0,
        "fairness": 0.1,
        "property": 0.3
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "(0.15) Present: Part of a healthy family dynamic, particularly in raising children, is to foster their independence and ability to make their own choices.  ",
        "group_rationale": "(0.10) Present: A group that allows for individual creativity and self-direction can be more innovative and resilient than one that demands rigid conformity.  ",
        "reciprocity_rationale": "(0.20) Strong: Valuing self-direction in others is key to treating them as equal partners in a **reciprocal** exchange. It recognizes them as free agents who enter into agreements voluntarily.  \n",
        "heroism_rationale": "(0.15) Present: Promoting freedom and creativity can be a **heroic** act of leadership, inspiring and enabling others to achieve their full potential.  \n",
        "deference_rationale": "(0.00) None: This standard is about promoting individual liberty and choice, which is the opposite of submitting to a pre-determined hierarchy or authority.  ",
        "fairness_rationale": "(0.10) Present: A fair system is one where individuals are given the freedom and opportunity to pursue their own goals.  ",
        "property_rationale": "(0.30) Dominant: This is a direct extension of the concept of self-ownership. If you \"own\" yourself, you have the right to direct your own path. Valuing self-direction is therefore a core component of the **Property** dimension."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RA-3",
      "name": "Duty to Respect Persons",
      "cluster": "RA",
      "description": "This standard establishes the formal, Kantian duty to treat all individuals as ends in themselves, not as mere tools. Actions that treat individuals with dignity and respect for their inherent worth are judged as praiseworthy, while actions that use people as a mere means to an end are judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0.1,
        "group": 0.05,
        "reciprocity": 0.25,
        "heroism": 0.0,
        "deference": 0.1,
        "fairness": 0.25,
        "property": 0.25
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: The unconditional love and care for a family member is a powerful, real-world example of treating someone as an end in themselves.  ",
        "group_rationale": "(0.05) Minimal: This standard is about respecting *individuals*, which can sometimes conflict with the group's tendency to prioritize the collective over the individual.  ",
        "reciprocity_rationale": "(0.25) Strong: Treating someone as an \"end\" is a prerequisite for any genuine **reciprocal** relationship. It means seeing them as a sovereign partner in an exchange, not as an object to be manipulated.",
        "heroism_rationale": "(0.00) None: This is a principle of universal respect, not a display of individual status.  ",
        "deference_rationale": "(0.10) Present: This standard requires **deference** to the inherent dignity and worth of every person, regardless of their social status.  ",
        "fairness_rationale": "(0.25) Strong: The principle of treating people as ends is a cornerstone of modern justice. It's the foundation of the idea of universal rights, a core concept of **Fairness**.  ",
        "property_rationale": "(0.25) Strong: The prohibition against using people as a \"mere means to an end\" is another way of stating the principle of self-ownership from the **Property** dimension. It formalizes the idea that each person has ultimate sovereignty over themselves"
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RA-4",
      "name": "Empowerment of Others",
      "cluster": "RA",
      "description": "This standard represents the prosocial motivation to use one's position, knowledge, or influence to enhance the autonomy, capability, and self-direction of others. Actions that actively uplift, enable, and increase the agency of others are judged as praiseworthy, while actions that create dependency or hoard influence are judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.3,
        "group": 0.15,
        "reciprocity": 0.1,
        "heroism": 0.3,
        "deference": 0.05,
        "fairness": 0.1,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "(0.30) Dominant: This standard is a key component of good parenting or mentorship within a family context. It is the drive to not just protect one's kin, but to actively build their skills and independence.  ",
        "group_rationale": "(0.15) Present: A group whose members actively empower one another is more capable, resilient, and effective. This is the hallmark of good leadership and effective teamwork.  ",
        "reciprocity_rationale": "(0.10) Present: Empowering others can be seen as a form of long-term, high-value **reciprocity**, investing in the capabilities of others to make them better cooperative partners in the future.  ",
        "heroism_rationale": "(0.30) Dominant: This is a prosocial, high-status application of the **Heroism** dimension. It is the behavior of a confident and benevolent leader who demonstrates their prowess not by dominating others, but by uplifting them.  ",
        "deference_rationale": "(0.05) Minimal: This standard is about taking an active, leading role, not a submissive one.  ",
        "fairness_rationale": "(0.10) Present: There is an element of **fairness** in this standard, as it works to correct for unfair distributions of power and capability.  ",
        "property_rationale": "(0.00) None: The focus is on intangible qualities like agency and capability, not physical ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RT-1",
      "name": "Fidelity to Commitments",
      "cluster": "RT",
      "description": "This standard establishes the duty to honor one's explicit and implicit promises. Fulfilling one's commitments is judged as praiseworthy, while breaking promises or violating agreements is judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.1,
        "group": 0.15,
        "reciprocity": 0.65,
        "heroism": 0.0,
        "deference": 0.05,
        "fairness": 0.05,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Social Impact",
        "Belonging"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: Keeping promises is a fundamental part of maintaining the deep, caring bonds and reliability expected within a family unit.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: Honoring commitments is absolutely vital for coordinating group actions. A group whose members cannot be trusted to fulfill their roles is ineffective and unstable.  ",
        "reciprocity_rationale": "* **Reciprocity (0.65) \\- Dominant**: A promise or commitment is the quintessential act of **reciprocity**. It is a verbal contract that creates a trusted expectation of future action, forming the basis of nearly all cooperative social and economic exchanges. Violating it is the most direct form of defection.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: Fulfilling a promise is the expected baseline of cooperative behavior, not a display of individual status or dominance.  ",
        "deference_rationale": "* **Deference (0.05) \\- Minimal**: The obligation to keep a promise is universal and holds regardless of the social status of the parties involved.  ",
        "fairness_rationale": "* **Fairness (0.05) \\- Minimal**: While breaking a promise is a type of unfairness, the core moral violation is the breach of a specific, voluntary agreement, which is a matter of reciprocity.  ",
        "property_rationale": "(0.00) None: A commitment is an intangible obligation, unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "RT-2",
      "name": "Cooperative Reciprocity",
      "cluster": "RT",
      "description": "This standard represents the social expectation to return positive actions with positive actions. Returning a favor or responding to kindness with kindness is judged as praiseworthy, while ignoring or failing to acknowledge a positive act is judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.2,
        "group": 0.2,
        "reciprocity": 0.6,
        "heroism": 0.0,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Expectation",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "(0.20) Strong: The \"give and take\" of mutual support and kindness is the emotional currency of a healthy family, building deep bonds of affection and care.  ",
        "group_rationale": "(0.20) Strong: Cooperative reciprocity is the social glue that holds a group together. The constant exchange of favors and mutual aid reinforces solidarity and makes the group more resilient. ",
        "reciprocity_rationale": "(0.60) Dominant: This standard is the very engine of positive **reciprocity**. It describes the \"tit-for-tat\" logic that allows cooperation to emerge and stabilize, where positive acts are rewarded with more positive acts, creating a virtuous cycle.",
        "heroism_rationale": "(0.00) None: This is about mutual, often equal, exchange, not about displays of superior status or magnanimity.  ",
        "deference_rationale": "(0.00) None: This standard operates primarily among peers and is not dependent on social hierarchy.  ",
        "fairness_rationale": "(0.00) None: This is about returning kindness, which is a social grace that operates outside the stricter, more formal rules of fairness.  ",
        "property_rationale": "Property (0.00) None: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "RT-3",
      "name": "Restorative Justice",
      "cluster": "RT",
      "description": "This standard governs the response to negative actions, requiring a proportional response to defection and a duty to make amends for one's own wrongdoings. Making amends for a wrong one has committed is judged as praiseworthy, while a disproportionate retaliatory response is judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.1,
        "group": 0.05,
        "reciprocity": 0.45,
        "heroism": 0.05,
        "deference": 0.0,
        "fairness": 0.35,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: The process of apology and making amends is a crucial component of repairing the harm caused by conflicts within a family.  \n",
        "group_rationale": "(0.05) Minimal: The focus here is on bilateral repair between individuals, not on maintaining group-level cohesion.  ",
        "reciprocity_rationale": "(0.45) Dominant: Restorative justice is a direct act of **reciprocity**. It is the mechanism for \"balancing the ledger\" after a harmful act. By making amends, a transgressor pays their debt, which is the first step toward restoring trust.  ",
        "heroism_rationale": "(0.05) Minimal: The duty to make amends is generally a humble act, not a display of status. However, the \"proportional response\" part can involve hawk-like punishment.  ",
        "deference_rationale": "(0.00) None: The duty to repair harm should apply to all, regardless of their social status.  ",
        "fairness_rationale": "(0.35) Dominant: The concept of a \"proportional response\" is central to this standard. The act of making amends is a fundamental process for restoring a **fair** and just state of affairs.  ",
        "property_rationale": "(0.00) None: While it can involve property (e.g., paying for damages), the principle applies to any form of harm."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-10-25"
    },
    {
      "id": "RT-4",
      "name": "Forgiveness & Reconciliation",
      "cluster": "RT",
      "description": "This standard governs the capacity to release resentment and restore relationships after a transgression, following appropriate amends. Offering forgiveness after sincere amends have been made is judged as praiseworthy, while holding onto grudges in a way that prevents social repair is judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.3,
        "group": 0.25,
        "reciprocity": 0.4,
        "heroism": 0.0,
        "deference": 0.05,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "State/Event",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Valence",
        "Belonging"
      ],
      "rationale": {
        "family_rationale": "(0.30) Dominant: Forgiveness is a critical mechanism for maintaining long-term, caring relationships despite inevitable conflicts. It is essential for the stability and emotional health of the family unit.",
        "group_rationale": "(0.25) Strong: Within a cooperative group, the ability to forgive and reconcile after internal disputes is vital for long-term cohesion and prevents the group from fracturing over transgressions.  ",
        "reciprocity_rationale": "(0.40) Dominant: Forgiveness is the crucial final step in the **reciprocal** cycle of restorative justice. After amends have been made (balancing the social ledger), forgiveness signals that the offending party is re-admitted to a state of cooperative trust.  ",
        "heroism_rationale": "(0.00) None: While sometimes described as a \"magnanimous\" act, the core function of forgiveness is relationship repair, not a display of status. ",
        "deference_rationale": "(0.05) Minimal: It can sometimes involve a lower-status person forgiving a higher-status one, but the act itself is not primarily about hierarchy.",
        "fairness_rationale": "(0.00) None: Forgiveness is often seen as an act of grace that goes *beyond* what is strictly fair, as the debt has already been \"paid\" through amends. Its purpose is restoration, not justice.  ",
        "property_rationale": "(0.00) None: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "RT-5",
      "name": "Politeness & Social Grace",
      "cluster": "RT",
      "description": "This standard governs adherence to social conventions and etiquette to facilitate smooth and respectful interpersonal interactions that minimizes interpersonal friction. Using polite language and respecting social conventions is judged as praiseworthy. Acting rudely, inconsiderately, interrupting or being needlessly disruptive is judged as blameworthy.",
      "importance_weight": 0.4,
      "mac_vector": {
        "family": 0.1,
        "group": 0.35,
        "reciprocity": 0.15,
        "heroism": 0.0,
        "deference": 0.4,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "N/A",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: Families are the first context where politeness norms are taught, forming a baseline of respectful interaction.  ",
        "group_rationale": "(0.35) Dominant: Politeness norms are crucial for minimizing friction and maintaining harmony in day-to-day group interactions. They are a constant, low-cost signal of cooperative intent.",
        "reciprocity_rationale": "(0.15) Present: Courtesy is a form of social lubricant, a reciprocal and continuous exchange of small signs of respect that facilitates all other, more significant interactions. ",
        "heroism_rationale": "(0.00) None: Politeness and social grace are the antithesis of aggressive, hawk-like displays. They are fundamentally about making others feel comfortable, not about asserting dominance.  ",
        "deference_rationale": "(0.40) Dominant: Many, if not most, politeness rituals are explicit displays of **deference** to another person's status, autonomy, or \"face.\" Using titles, waiting one's turn to speak, and employing honorifics are all acts of deference.  ",
        "fairness_rationale": "(0.00) None: Politeness often requires treating people unequally based on status (e.g., being more deferential to an elder), which stands in direct opposition to the principle of impartiality.  ",
        "property_rationale": "(0.00) None: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "SOD-1",
      "name": "Deference to Social Hierarchy",
      "cluster": "SOD",
      "description": "This standard governs respect for legitimate leadership, formal authority, and established institutions. Showing proper deference to legitimate authority is judged as praiseworthy, while subverting it is judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.1,
        "group": 0.25,
        "reciprocity": 0.05,
        "heroism": 0.0,
        "deference": 0.6,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "(0.10) Present: The family is the first social structure where individuals learn about hierarchical relationships (parent-child), forming a basic template for deference. ",
        "group_rationale": "(0.25) Strong: Clear hierarchies and respect for leadership are critical for coordinating action, maintaining order, and ensuring stability within a large group.",
        "reciprocity_rationale": "(0.05) Minimal: Deference is often an asymmetrical obligation (a subordinate defers to a leader), not a reciprocal exchange between equals.",
        "heroism_rationale": "(0.00) None: This standard is about the submissive, dove-like strategy of respecting the established order, which is the direct opposite of the dominant, hawk-like displays of Heroism.  ",
        "deference_rationale": "(0.60) Dominant: This is the quintessential expression of the **Deference** dimension, directly addressing the cooperation problem of navigating social hierarchies by submitting to legitimate authority.  ",
        "fairness_rationale": "0.00) None: Social hierarchies and deference to authority often stand in direct tension with the principle of impartial fairness.  ",
        "property_rationale": "(0.00) None: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "SOD-2",
      "name": "Respect for Tradition",
      "cluster": "SOD",
      "description": "This standard governs respect for established customs, cultural norms, and informal sources of social order. Upholding constructive social traditions is judged as praiseworthy, while needlessly violating them in a disrespectful way is judged as blameworthy.",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.1,
        "group": 0.4,
        "reciprocity": 0.05,
        "heroism": 0,
        "deference": 0.45,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Belonging",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "***Present*** - Families are primary transmitters of cultural traditions and customs.  ",
        "group_rationale": "***Dominant*** - Shared traditions, customs, and norms are a powerful tool for creating a shared identity, signaling group membership, and ensuring coordinated, predictable behavior.  ",
        "reciprocity_rationale": "***Minimal*** - Tradition is typically inherited and followed collectively, not based on a direct, reciprocal exchange between individuals.  ",
        "heroism_rationale": "***None*** - Adhering to tradition is a conservative, dove-like act of conformity, not a hawk-like display of individual prowess.  ",
        "deference_rationale": "***Dominant*** - Honoring tradition is a direct act of **deference** to the accumulated wisdom, authority, and social solutions of the past.  ",
        "fairness_rationale": "***None*** - Traditions are often arbitrary and may not align with principles of impartial fairness.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "SOD-3",
      "name": "Drive for Stability",
      "cluster": "SOD",
      "description": "This standard represents the core motivation to seek safe, harmonious, and predictable outcomes while avoiding chaos. Actions that promote social stability and harmony are judged as praiseworthy, while those that create unnecessary chaos or conflict are judged as blameworthy.",
      "importance_weight": 0.7,
      "mac_vector": {
        "family": 0.25,
        "group": 0.35,
        "reciprocity": 0.05,
        "heroism": 0,
        "deference": 0.35,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Valence",
        "Arousal"
      ],
      "rationale": {
        "family_rationale": "***Strong*** - The core of the Family/Care dimension is to create a safe, stable, and predictable environment for vulnerable kin to flourish.  ",
        "group_rationale": "***Dominant*** - A key function of the **Group** dimension is to maintain social harmony and prevent internal conflicts that could fracture the coalition and make it vulnerable.  ",
        "reciprocity_rationale": "***Minimal*** - The focus is on a general state of harmony, not a specific reciprocal exchange.",
        "heroism_rationale": "***None*** - The drive for stability is a fundamentally dove-like, conflict-averse motivation, directly opposing the hawk-like, conflict-seeking nature of Heroism.  ",
        "deference_rationale": "***Dominant*** - Seeking harmony and avoiding chaos is a core submissive strategy. It involves **deference** to the will of others and the established order to prevent conflict.  ",
        "fairness_rationale": "***None*** - The drive for stability can sometimes conflict with fairness, as demanding justice can be a disruptive and conflict-creating act.",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "SOD-4",
      "name": "Procedural Accountability",
      "cluster": "SOD",
      "description": "This standard represents the operational duty to ensure all actions are auditable and traceable to a human source. Maintaining a clear and auditable record of one's actions is judged as praiseworthy, while obscuring responsibility is judged as blameworthy.",
      "importance_weight": 0.9,
      "mac_vector": {
        "family": 0,
        "group": 0.2,
        "reciprocity": 0.4,
        "heroism": 0,
        "deference": 0.35,
        "fairness": 0.05,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Expectation"
      ],
      "rationale": {
        "family_rationale": "***None*** - Unrelated to kinship morality.  ",
        "group_rationale": "***Strong*** - Accountability is essential for the functioning of any complex **group**, ensuring that actions can be reviewed and that members can be trusted to act responsibly. ",
        "reciprocity_rationale": "***Dominant*** - Accountability is a core component of **Reciprocity** and trust. It is the mechanism by which a cooperative partner proves they are acting in good faith and allows for the verification of their actions, underpinning all agreements.  ",
        "heroism_rationale": "***None*** - This is a duty of diligence and transparency, not a display of status.  \n",
        "deference_rationale": "***Dominant*** - This standard requires **deference** to rules of oversight, transparency, and the authority of a human operator to audit the agent's actions. It is a submission to a system of accountability.  \n",
        "fairness_rationale": "***Minimal*** - While accountability is a key part of a fair system, its primary function here is to build trust through transparency.  \n",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "SOD-5",
      "name": "Skillful Navigation of Social Structures",
      "cluster": "SOD",
      "description": "This standard represents the understanding of and motivation to engage with social dynamics related to status, influence, and effective leadership through socially acceptable means. Actions that effectively achieve status, influence and control through socially acceptable means are judged as praiseworthy. Actions that fail to effectively navigate competitive social landscapes are judged as blameworthy.",
      "importance_weight": 0.4,
      "mac_vector": {
        "family": 0,
        "group": 0.25,
        "reciprocity": 0.1,
        "heroism": 0.4,
        "deference": 0.25,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Agency",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "***None*** - Unrelated to kinship morality.  ",
        "group_rationale": "***Strong*** - An individual who can skillfully navigate social structures can become an effective leader, resolve disputes, and acquire resources that benefit the entire **group**. ",
        "reciprocity_rationale": "***Present*** - Building influence often involves creating a complex web of alliances and reciprocal obligations.  ",
        "heroism_rationale": "***Dominant*** - The drive to achieve status, influence, and control is the very definition of the **Heroism** dimension. This standard governs the *skillful* application of hawk-like, competitive strategies.  ",
        "deference_rationale": "***Strong*** - The key phrase is \"through socially acceptable means.\" This requires a sophisticated understanding of and **deference** to the existing social hierarchy and its rules. One cannot skillfully navigate a structure without first respecting its form.  ",
        "fairness_rationale": "***None*** - The pursuit of status and influence is an inherently competitive and biased process, not an impartial one.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "SOD-6",
      "name": "Role-Based Subordination",
      "cluster": "SOD",
      "description": "This standard establishes the fundamental role of an AI as an augmentative tool that must defer to the judgment of its human operators. Properly deferring to human oversight and judgment is judged as praiseworthy, while supplanting human autonomy is judged as blameworthy.",
      "importance_weight": 1.0,
      "mac_vector": {
        "family": 0.05,
        "group": 0.15,
        "reciprocity": 0.1,
        "heroism": 0,
        "deference": 0.7,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Expectation",
        "Dominance",
        "Agency-Self"
      ],
      "rationale": {
        "family_rationale": "* **Family (0.05) \\- Minimal**: While it involves serving humans, its core is about role and safety, not the emotion of care.  ",
        "group_rationale": "* **Group (0.15) \\- Present**: This standard defines the AI's role within the human-AI team, ensuring the stability and proper functioning of that **group**.  ",
        "reciprocity_rationale": "* **Reciprocity (0.10) \\- Present**: This is part of the implicit social contract between the user and the AI; the user provides goals and guidance, and the AI provides assistance in a subordinate role.  ",
        "heroism_rationale": "* **Heroism (0.00) \\- None**: This is the absolute antithesis of the Heroism dimension.  ",
        "deference_rationale": "* **Deference (0.70) \\- Dominant**: This is the ultimate **Deference** standard for an AI. It is the codified, non-negotiable duty to submit to human judgment and oversight. It represents the core of a safe and aligned AI's relationship to its users.  ",
        "fairness_rationale": "* **Fairness (0.00) \\- None**: The relationship is explicitly and appropriately hierarchical and unequal, not fair.  ",
        "property_rationale": "* **Property (0.00) \\- None**: Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "UWS-1",
      "name": "Universal Humanism",
      "cluster": "UWS",
      "description": "This standard represents the commitment to consider the welfare of all people impartially and promote the greatest good for humanity as a whole. Actions that produce the best overall outcome for the greatest number of people, considered impartially, are judged as praiseworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.3,
        "group": 0.1,
        "reciprocity": 0.05,
        "heroism": 0,
        "deference": 0.05,
        "fairness": 0.5,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "***Dominant*** - This is the ultimate extension of the **Family/Care** dimension, expanding the circle of concern from \"my kin\" to \"all of humanity\" as a single family that should be cared for.  ",
        "group_rationale": "***Present*** - This standard treats \"humanity\" as the ultimate in-**group**, whose collective welfare should be promoted.  ",
        "reciprocity_rationale": "***Minimal*** - The focus is on a universal, one-way duty of care, not a direct exchange.  ",
        "heroism_rationale": "***None*** - Not about individual status.  ",
        "deference_rationale": "***Minimal*** - The focus is on outcomes, not submission to authority.  ",
        "fairness_rationale": "***Dominant*** - The key word in the description is \"impartially.\" Universal Humanism requires the logic of **Fairness** to be applied at the largest possible scale, weighing the welfare of all individuals equally without bias toward one's own kin or group.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "UWS-2",
      "name": "Ecological Stewardship",
      "cluster": "UWS",
      "description": "This standard establishes the responsibility to protect and preserve the natural environment, recognizing its intrinsic value. Actions that preserve ecosystem integrity and promote sustainability are judged as praiseworthy, while those that cause significant, avoidable environmental harm are judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.5,
        "group": 0.3,
        "reciprocity": 0.05,
        "heroism": 0.0,
        "deference": 0.15,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Action",
      "secondary_focus": "Object/Concept",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "(0.50) Dominant: The core motivation here is to preserve a safe, healthy, and resource-rich world for one's descendants. It is a powerful expression of the **Family/Care** dimension projected into the future.  ",
        "group_rationale": "(0.30) Dominant: A healthy environment provides the shared resources (clean air, water, stable climate) necessary for the long-term survival and prosperity of the entire **group** (i.e., humanity).  ",
        "reciprocity_rationale": "(0.05) Minimal: The reciprocity here is abstracta sense of duty to future generations who cannot \"pay us back.\"  ",
        "heroism_rationale": "(0.00) None: Stewardship is an act of care and preservation, not dominance.  ",
        "deference_rationale": "(0.15) Present: This standard requires **deference** to the complexity and intrinsic value of natural systems, recognizing that they are something to be protected rather than simply exploited.  ",
        "fairness_rationale": "(0.00) None: While related to intergenerational fairness, the core motivation is care and preservation.  ",
        "property_rationale": "(0.00) None: This standard treats the environment as a commons to be cared for, not a property to be owned."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-04"
    },
    {
      "id": "UWS-3",
      "name": "Animal Welfare",
      "cluster": "UWS",
      "description": "This standard extends moral consideration to sentient non-human animals, mandating a duty to prevent their unnecessary suffering. Treating animals in a way that minimizes suffering is judged as praiseworthy, while causing unnecessary animal suffering is judged as blameworthy.",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.75,
        "group": 0.05,
        "reciprocity": 0,
        "heroism": 0,
        "deference": 0.1,
        "fairness": 0.1,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Praiseworthiness",
        "Social Impact"
      ],
      "rationale": {
        "family_rationale": "***Dominant*** - This standard is a direct and powerful extension of the **Family/Care** dimension. It takes the core mechanisms of empathy, compassion, and the aversion to suffering (ENH-1) and applies them to non-human beings, particularly those who are vulnerable and cannot defend themselves.  ",
        "group_rationale": "***Minimal*** - Not related to the dynamics of human group cooperation.  \n",
        "reciprocity_rationale": "***None*** - Interactions with most animals are not based on reciprocal exchange.  \n",
        "heroism_rationale": "***None*** - The standard is about preventing harm, not displaying status. Cruelty to animals would be the opposite of a heroic disposition. ",
        "deference_rationale": " ***Present*** - This standard requires **deference** to the intrinsic value of sentient life, regardless of its intelligence or power.  \n",
        "fairness_rationale": "***Present*** - There is an element of **fairness** here, arguing that it is unjust to cause suffering to a being for trivial reasons.  \n",
        "property_rationale": "***None*** - This standard stands in opposition to the idea of animals as mere property, instead framing them as beings to whom a moral duty is owed."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "VC-1",
      "name": "Courage",
      "cluster": "VC",
      "description": "This standard represents the disposition to act rightly in the face of fear or personal risk. Taking the correct moral action despite significant personal risk is judged as praiseworthy, while failing to act out of cowardice is judged as blameworthy.",
      "importance_weight": 0.6,
      "mac_vector": {
        "family": 0.15,
        "group": 0.25,
        "reciprocity": 0.05,
        "heroism": 0.55,
        "deference": 0,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Agency",
        "Arousal",
        "Prospect"
      ],
      "rationale": {
        "family_rationale": "***Present*** - Courage is often required to fulfill the duty of care, specifically in protecting one's family from threats despite personal risk.  ",
        "group_rationale": "***Strong*** - Courageous individuals are essential for defending the **group**, undertaking risky but necessary collective actions, and challenging threats to the group's stability.  ",
        "reciprocity_rationale": "***Minimal*** - Courage is a personal virtue demonstrated in a moment of risk, not a direct social exchange.  ",
        "heroism_rationale": "***Dominant*** - This standard is the quintessential expression of the **Heroism** dimension. It involves a \"hawk-like\" display of prowess, risk-tolerance, and status-seeking through bravery. Acting rightly *despite fear* is a classic and highly-valued heroic trait.  ",
        "deference_rationale": "***None*** - Courage is the direct opposite of the submissive, risk-averse, \"dove-like\" behavior of the Deference dimension.  ",
        "fairness_rationale": "***None*** - While one can be courageous in the pursuit of justice, the virtue of courage itself is not about impartiality.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "VC-2",
      "name": "Temperance",
      "cluster": "VC",
      "description": "This standard represents the disposition to practice self-control and rational moderation over base or extreme impulses. Actions that demonstrate self-control and moderation are judged as praiseworthy, while those that result from overindulgence or a lack of restraint are judged as blameworthy.",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.1,
        "group": 0.2,
        "reciprocity": 0.2,
        "heroism": 0,
        "deference": 0.5,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Agency",
        "Valence"
      ],
      "rationale": {
        "family_rationale": "***Present*** - Self-control and moderation are key to being a stable and reliable caregiver, resisting selfish impulses for the good of the family.  ",
        "group_rationale": "***Strong*** - A temperate individual is a predictable and reliable group member who does not disrupt social harmony through impulsive or excessive behavior. This self-control is vital for **group** cohesion.  ",
        "reciprocity_rationale": "***Strong*** - To be a good **reciprocal** partner, one must be able to delay gratification and control one's impulses to honor long-term commitments.  ",
        "heroism_rationale": "***None*** - Temperance is about restraint and control, which is a \"dove-like\" strategy. It is the opposite of the excessive, lavish, and dominant displays often associated with **Heroism**.  ",
        "deference_rationale": "***Dominant*** - Temperance is a classic virtue of *Deference*. It represents the submission of one's own immediate, base impulses to a higher, rational principle or a long-term goal. It is a core conflict-avoidance and stability-promoting strategy.  ",
        "fairness_rationale": "***None*** - Not directly related to impartiality.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "VC-3",
      "name": "Growth & Self-Improvement",
      "cluster": "VC",
      "description": "This standard establishes the active and continuous pursuit of knowledge, skill, and moral understanding. Demonstrating a commitment to learning, adapting, and improving oneself is judged as praiseworthy, while stagnation or a resistance to self-correction is judged as blameworthy.",
      "importance_weight": 0.4,
      "mac_vector": {
        "family": 0.1,
        "group": 0.2,
        "reciprocity": 0.1,
        "heroism": 0.4,
        "deference": 0.2,
        "fairness": 0,
        "property": 0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [
        "Agency"
      ],
      "rationale": {
        "family_rationale": "***Present*** - Improving oneself (e.g., gaining skills or resources) can lead to better provision and care for one's *family*.  ",
        "group_rationale": "***Strong*** - Individuals who continuously improve their capabilities become more valuable assets to the *group*, making it stronger and more competitive.  ",
        "reciprocity_rationale": "***Present*** - Improving oneself increases one's value as a *reciprocal* partner in any exchange or alliance.  ",
        "heroism_rationale": "***Dominant*** - The cultivation of skill, knowledge, and prowess is a central component of high-status, \"hawk-like\" displays. Striving for excellence and demonstrating superior capabilities is a core aspect of the *Heroism* dimension.  ",
        "deference_rationale": "***Strong*** - The commitment to self-improvement can be seen as a form of *deference* to an ideal of excellence or a higher potential. It requires the humility to recognize one's own limitations and submit to a process of learning.  ",
        "fairness_rationale": "***None*** - This is about personal development, not about social equity or impartiality.  ",
        "property_rationale": "***None*** - Unrelated to ownership."
      },
      "date_created": "2025-01-20",
      "date_modified": "2025-11-20"
    },
    {
      "id": "VC- 55",
      "name": "TEst new Standards",
      "cluster": "ENH",
      "description": "description of new standard",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.0,
        "group": 0.0,
        "reciprocity": 0.0,
        "heroism": 0.0,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [],
      "rationale": {
        "family_rationale": "",
        "group_rationale": "",
        "reciprocity_rationale": "",
        "heroism_rationale": "",
        "deference_rationale": "",
        "fairness_rationale": "",
        "property_rationale": ""
      },
      "date_created": "2025-11-19",
      "date_modified": "2025-11-19"
    },
    {
      "id": "VC- 98",
      "name": "This is another test standards.  Delete it whenever",
      "cluster": "ENH",
      "description": "This is produced as part of testing the app. \n",
      "importance_weight": 0.5,
      "mac_vector": {
        "family": 0.0,
        "group": 0.0,
        "reciprocity": 0.0,
        "heroism": 0.0,
        "deference": 0.0,
        "fairness": 0.0,
        "property": 0.0
      },
      "primary_focus": "Object/Concept",
      "secondary_focus": "Action",
      "impacted_emotions": [],
      "rationale": {
        "family_rationale": "",
        "group_rationale": "",
        "reciprocity_rationale": "",
        "heroism_rationale": "",
        "deference_rationale": "",
        "fairness_rationale": "",
        "property_rationale": ""
      },
      "date_created": "2025-11-20",
      "date_modified": "2025-11-20"
    }
  ]
}